class 僱員:
    '僱員物件'
    人員總數 = 0
    
    def __init__(self, 職稱, 薪水):
        self.職稱 = 職稱
        self.薪水 = 薪水
        僱員.人員總數 += 1

    def 列出個數(self):
        try:
            g.es("總共有人員 %d" % 僱員.人員總數)
        except:
            print("總共有人員 %d" % 僱員.人員總數)

    def 列出基本資料(self):
        try:
            g.es("職稱 : ", self.職稱,  ", 薪水: ", self.薪水)
        except:
            print("職稱 : ", self.職稱,  ", 薪水: ", self.薪水)
      
"開始利用僱員物件建立案例"
僱員1 = 僱員("王一名", 55000)
"建立另外一位僱員"
僱員2 = 僱員("林人二", 65000)

僱員1.列出基本資料()
僱員2.列出基本資料()
try:
    g.es("目前為止, 有 %d 位僱員" % 僱員.人員總數)
except:
    print("目前為止, 有 %d 位僱員" % 僱員.人員總數)
